In [4]:
import pandas as pd

In [15]:
labels=['a','b','c','d','e']
data=[10,20,30,40,50]
Series_with_labels=pd.Series(data,index=labels)
print("Roll No:23G01A4331")
print("Pandas Series with Labels:")
print(Series_with_labels)
type(Series_with_labels)

Roll No:23G01A4331
Pandas Series with Labels:
a    10
b    20
c    30
d    40
e    50
dtype: int64

pandas.core.series.Series

In [16]:
data_dict={"a":100,"b":200,"c":300,"d":400,"e":500}
Series_from_dict=pd.Series(data_dict)
print("Roll No:23G01A4331")
print("\nPandas Series from Dictionary:")
print(Series_from_dict)

Roll No:23G01A4331

Pandas Series from Dictionary:
a    100
b    200
c    300
d    400
e    500
dtype: int64

In [17]:
data_dict_df={
   "Name":["Ravi","Reenu","Bubu","Dudu","Lassie","Sravani"],
   "Age":[31,61,18,12,10,5],
   "Salary":[50000,60000,70000,80000,55000,45000]
}
print("Roll No:23G01A4331")
df= pd.DataFrame(data_dict_df)
print("\nPandas DataFrame:")
print(df)
type(data_dict_df)

Roll No:23G01A4331

Pandas DataFrame:
      Name  Age  Salary
0     Ravi   31   50000
1    Reenu   61   60000
2     Bubu   18   70000
3     Dudu   12   80000
4   Lassie   10   55000
5  Sravani    5   45000

dict

In [18]:
df.describe()

             Age       Salary
count   6.000000      6.00000
mean   22.833333  60000.00000
std    20.721165  13038.40481
min     5.000000  45000.00000
25%    10.500000  51250.00000
50%    15.000000  57500.00000
75%    27.750000  67500.00000
max    61.000000  80000.00000

In [19]:
df.head()

     Name  Age  Salary
0    Ravi   31   50000
1   Reenu   61   60000
2    Bubu   18   70000
3    Dudu   12   80000
4  Lassie   10   55000

In [20]:
df.head(3)

    Name  Age  Salary
0   Ravi   31   50000
1  Reenu   61   60000
2   Bubu   18   70000

In [21]:
df.tail()

      Name  Age  Salary
1    Reenu   61   60000
2     Bubu   18   70000
3     Dudu   12   80000
4   Lassie   10   55000
5  Sravani    5   45000

In [22]:
df.tail(2)

      Name  Age  Salary
4   Lassie   10   55000
5  Sravani    5   45000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Salary  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes